mentatpsi/Microchip/Graphics/Multi-App/Configs/HWP_MEB_PIC32_ETH_SK_16PMP_USBMSD.h
// Using PH480272T_005_I11Q Display Panel
	#if defined (GFX_USE_DISPLAY_PANEL_PH480272T_005_I11Q) 
		#define DISP_ORIENTATION		0
        #define DISP_HOR_RESOLUTION		480
        #define DISP_VER_RESOLUTION		272
        #define DISP_DATA_WIDTH			24
        #define DISP_HOR_PULSE_WIDTH    41
        #define DISP_HOR_BACK_PORCH     2
        #define DISP_HOR_FRONT_PORCH    2
        #define DISP_VER_PULSE_WIDTH    10
        #define DISP_VER_BACK_PORCH     2
        #define DISP_VER_FRONT_PORCH    2
    	#define GFX_LCD_TYPE            GFX_LCD_TFT
        
        #if defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
            #define GFX_DISPLAYENABLE_ENABLE
            #define GFX_HSYNC_ENABLE
            #define GFX_VSYNC_ENABLE
            #define GFX_DISPLAYPOWER_ENABLE
            #define GFX_CLOCK_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYENABLE_POLARITY          GFX_ACTIVE_HIGH
            #define GFX_HSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_VSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYPOWER_POLARITY           GFX_ACTIVE_HIGH
        #endif // #if defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
	#endif // 	#if defined (GFX_USE_DISPLAY_PANEL_PH480272T_005_I11Q) 

// Using TFT_640480_8_E Display Panel
	#if defined (GFX_USE_DISPLAY_PANEL_TFT_640480_8_E) 
        #define DISP_ORIENTATION        0
        #define DISP_HOR_RESOLUTION     640
        #define DISP_VER_RESOLUTION     480
        #define DISP_HOR_PULSE_WIDTH    30
        #define DISP_HOR_BACK_PORCH     128
        #define DISP_HOR_FRONT_PORCH    2
        #define DISP_VER_PULSE_WIDTH    3              
        #define DISP_VER_BACK_PORCH     35
        #define DISP_VER_FRONT_PORCH    7
        #define DISP_INV_LSHIFT
    	#define GFX_LCD_TYPE            GFX_LCD_TFT
        
        #if defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
            #define GFX_DISPLAYENABLE_ENABLE
            #define GFX_HSYNC_ENABLE
            #define GFX_VSYNC_ENABLE
            #define GFX_DISPLAYPOWER_ENABLE
            #define GFX_CLOCK_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYENABLE_POLARITY          GFX_ACTIVE_HIGH
            #define GFX_HSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_VSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYPOWER_POLARITY           GFX_ACTIVE_HIGH
        #endif // #if defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
	#endif // 	#if defined (GFX_USE_DISPLAY_PANEL_TFT_640480_8_E) 
    
// Using TFT_640480_8_E Display Panel
    #if defined (GFX_USE_DISPLAY_PANEL_TFT_800480_33_E)
        #define DISP_ORIENTATION		0
        #define DISP_HOR_RESOLUTION		800
        #define DISP_VER_RESOLUTION		480
        #define DISP_HOR_PULSE_WIDTH    128
        #define DISP_HOR_BACK_PORCH     129
        #define DISP_HOR_FRONT_PORCH    2
        #define DISP_VER_PULSE_WIDTH    2
        #define DISP_VER_BACK_PORCH     41
        #define DISP_VER_FRONT_PORCH    2
    	#define GFX_LCD_TYPE            GFX_LCD_TFT
        
        #if defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
            #define GFX_DISPLAYENABLE_ENABLE
            #define GFX_HSYNC_ENABLE
            #define GFX_VSYNC_ENABLE
            #define GFX_DISPLAYPOWER_ENABLE
            #define GFX_CLOCK_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYENABLE_POLARITY          GFX_ACTIVE_HIGH
            #define GFX_HSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_VSYNC_POLARITY                  GFX_ACTIVE_LOW
            #define GFX_DISPLAYPOWER_POLARITY           GFX_ACTIVE_HIGH
        #endif // #if defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
    #endif // Using TFT_640480_8_E Display Panel
    
//#endif // #if !defined (DISPLAY_PANEL) ...

// -----------------------------------
// Other driver dependencies
// -----------------------------------
#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
    #define USE_TCON_SSD1289
    #define USE_TCON_MODULE
    
#elif defined (GFX_USE_DISPLAY_PANEL_TFT_G320240DTSW_69W_TP_E) || defined (GFX_USE_DISPLAY_PANEL_35QVW0T)
    #define USE_TCON_HX8238
    #define USE_TCON_MODULE

#else
    #define GFX_USE_TCON_CUSTOM
#endif	


/*********************************************************************
* DISPLAY PARALLEL INTERFACE 
*********************************************************************/
/*
   Select the correct Parallel Master Port Interface Driver.
   This selection is valid only for parallel interface. When using
   display drivers that uses serial interface, this portion should be
   commented out or removed.
*/
#if defined (GFX_PICTAIL_LCC)
//No PMP Setup Here
#else
	// EPMP is exclusive to GB210 devices and PMP to some devices
	#if defined (__PIC24FJ256DA210__) || defined (__PIC24FJ256GB210__)
		// EPMP is used by graphics controller but if EPMP is used 
		// to access external memory then we will need EPMP driver.
		#define USE_GFX_EPMP
	#else
		#define USE_GFX_PMP
	#endif
#endif

/*********************************************************************
* PARALLEL MASTER PORT INTERFACE TIMING 
*********************************************************************/
	// When using the Parallel Master Port (or Enhanced Parallel Master Port) the 
	// PMP timing must be defined for the following:
	// PMP_DATA_SETUP_TIME or EPMPCSx_DATA_SETUP (for DWAITB) 
	// PMP_DATA_WAIT_TIME or EPMPCSx_DATA_WAIT_TIME (for DWAITM) 
	// and PMP_DATA_HOLD_TIME or EPMPCSx_DATA_HOLD_TIME (for DWAITE)
    // where x is 1 or 2 (EPMP has 2 chip selects)
	// All values are timing parameters in ns.
	// The timing is dependent on the display controller sampling period if 
	// interfacing with the display controller or device AC timing requirements
	// if interfacing with a device (such as SRAM or Parallel Flash memory).
	// Refer to your specific display controller or device to determine the 
	// optimum (fastest) timing requirement for your interface. 

