mentatpsi/Microchip/Graphics/Multi-App/Configs/HWP_MEB_PIC32_ETH_SK_16PMP_USBMSD.h
        Another macro that may affect the way the x and y measurement 
        are the following:
        TOUCHSCREEN_RESISTIVE_PRESS_THRESHOLD - determines how light the 
            touch on the screen. The smaller the  value the lighter the 
            touch. Valid range of values: 0-0x03ff
        TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR - this is the scale
            factor used to calculate the touch coefficients. The equation 
            to calculate the scale factor is:
               (1 << TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR).
            Valid values: 0 - 15 (most resistive touch screens will work 
                                  in the range of 5 - 7)

	*********************************************************************/

	/* ----------------------------------------- */
	#if defined (GFX_PICTAIL_V3)                || \
		  defined (GFX_PICTAIL_V3E)             || \
          defined (GFX_PICTAIL_LCC)             || \
		  defined (PIC24FJ256DA210_DEV_BOARD)   || \
	      defined (MEB_BOARD) 
	/* ----------------------------------------- */
		#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E) 

			#if (DISP_ORIENTATION == 0)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
			#elif (DISP_ORIENTATION == 180)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
			#endif	

        #endif

		#if defined (GFX_USE_DISPLAY_PANEL_TFT_640480_8_E)  ||  \
            defined (GFX_USE_DISPLAY_PANEL_TFT_800480_33_E)	

			#if (DISP_ORIENTATION == 0)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
			#elif (DISP_ORIENTATION == 180)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
			#endif	

        #endif

		#if defined (GFX_USE_DISPLAY_PANEL_PH480272T_005_I11Q)	

            #if (DISP_ORIENTATION == 90)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
			#elif (DISP_ORIENTATION == 270)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
			#endif	
            
		#endif
	#elif defined (MIKRO_BOARD)
        #define TOUCHSCREEN_RESISTIVE_PRESS_THRESHOLD           500
        #define TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR  6
	#endif
	
	/*********************************************************************
	* Touch Screen Non-Volatile Memory Storage Macros
	*********************************************************************/

	/* ----------------------------------------- */
    #if defined (USE_SST25VF016) || defined (USE_M25P80)
	/* ----------------------------------------- */
		// Addresses for calibration and version values in SPI Flash on Graphics PICtail 3 & PIC24FJ256DA210 Development Board.
		// Or Addresses for calibration and version values in Parallel Flash on PIC24FJ256DA210 Development Board.

        #define ADDRESS_RESISTIVE_TOUCH_VERSION	(unsigned long)0xFFFFFFFE
        #define ADDRESS_RESISTIVE_TOUCH_ULX   (unsigned long)0xFFFFFFFC
        #define ADDRESS_RESISTIVE_TOUCH_ULY   (unsigned long)0xFFFFFFFA
        #define ADDRESS_RESISTIVE_TOUCH_URX   (unsigned long)0xFFFFFFF8
        #define ADDRESS_RESISTIVE_TOUCH_URY   (unsigned long)0xFFFFFFF6

        #define ADDRESS_RESISTIVE_TOUCH_LLX   (unsigned long)0xFFFFFFF4
        #define ADDRESS_RESISTIVE_TOUCH_LLY   (unsigned long)0xFFFFFFF2
        #define ADDRESS_RESISTIVE_TOUCH_LRX   (unsigned long)0xFFFFFFF0
        #define ADDRESS_RESISTIVE_TOUCH_LRY   (unsigned long)0xFFFFFFEE

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)&SST25SectorErase)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&SST25WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&SST25ReadWord)

	/* ----------------------------------------- */
	#elif defined (USE_SST39LF400)
	/* ----------------------------------------- */
		// for  PIC24FJ256DA210 Dev Board 
		#define ADDRESS_RESISTIVE_TOUCH_VERSION	(unsigned long)0x0003FFFE
        #define ADDRESS_RESISTIVE_TOUCH_ULX   (unsigned long)0x0003FFFC
        #define ADDRESS_RESISTIVE_TOUCH_ULY   (unsigned long)0x0003FFFA
        #define ADDRESS_RESISTIVE_TOUCH_URX   (unsigned long)0x0003FFF8
        #define ADDRESS_RESISTIVE_TOUCH_URY   (unsigned long)0x0003FFF6

        #define ADDRESS_RESISTIVE_TOUCH_LLX   (unsigned long)0x0003FFF4
        #define ADDRESS_RESISTIVE_TOUCH_LLY   (unsigned long)0x0003FFF2
        #define ADDRESS_RESISTIVE_TOUCH_LRX   (unsigned long)0x0003FFF0
        #define ADDRESS_RESISTIVE_TOUCH_LRY   (unsigned long)0x0003FFEE
	    
        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)&SST39LF400SectorErase)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&SST39LF400WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&SST39LF400ReadWord)

	/* ----------------------------------------- */
	#else	// when no non-volatile memory is used
	/* ----------------------------------------- */
		#warning "Non-Volatile Memory addresses is not set for touch screen calibration"

		#define ADDRESS_RESISTIVE_TOUCH_VERSION	0
        #define ADDRESS_RESISTIVE_TOUCH_ULX     0
        #define ADDRESS_RESISTIVE_TOUCH_ULY     0
        #define ADDRESS_RESISTIVE_TOUCH_URX     0
        #define ADDRESS_RESISTIVE_TOUCH_URY     0

        #define ADDRESS_RESISTIVE_TOUCH_LLX     0
        #define ADDRESS_RESISTIVE_TOUCH_LLY     0
        #define ADDRESS_RESISTIVE_TOUCH_LRX     0
        #define ADDRESS_RESISTIVE_TOUCH_LRY     0

		#define NVMSectorErase					((void *)0)
    	#define NVMWrite 						((void *)0)
    	#define NVMRead 						((void *)0)

    #endif    

#endif // defined (USE_TOUCHSCREEN_RESISTIVE)

/*********************************************************************
* HARDWARE PROFILE FOR THE AR1020 TOUCHSCREEN 
*********************************************************************/
#if defined (USE_TOUCHSCREEN_AR1020)

	/*********************************************************************
	* Touch Screen X and Y orientation
	*********************************************************************/
	/*********************************************************************
	Description:
		The usage of the resistive touch screen will be affected 
		by the way the hardware is mapped to the A/D channels that
		samples the touch. Since resistive touch is basically a 
		measurement of X and Y coordinates the following are macros
		that can modify the touch algorithm when sampling the 
		touch.
		TOUCHSCREEN_RESISTIVE_FLIP_X - will flip the x direction. 	
		TOUCHSCREEN_RESISTIVE_FLIP_Y - will flip the y direction.
		TOUCHSCREEN_RESISTIVE_SWAP_XY - will swap the x and y sampling.
		
		As long as the (X-,Y-) and (X+,Y+) are used consistently,
		and connected properly in hardware, the macros above
		can provide options to the user to align the touch screen
		to the screen orientation.

